In [25]:
import tabula
import pandas as pd

In [27]:
df41 = tabula.read_pdf("C:/Users/unews/nss_data_science/Capstone/ASR1617.pdf",pages=41)

In [16]:
df41.head()

    Unnamed: 0   LICENSED INSTRUCTIONAL CLASSROOM Unnamed: 4      Unnamed: 5
0          NaN  EDUCATORS     PERSONNEL   TEACHER  PRINCIPAL  SUPERINTENDENT
1  ANDERSON CO     49,268        48,764    46,386     81,234         135,000
2      CLINTON     49,636        49,025    45,343     73,800         100,000
3    OAK RIDGE     66,065        65,927    63,519     98,186         188,840
4   BEDFORD CO     47,974        47,685    45,733     78,245         107,826

In [32]:
df41.shape

(62, 6)

In [20]:
df42 = tabula.read_pdf("C:/Users/unews/nss_data_science/Capstone/ASR1617.pdf",pages=42)

In [21]:
df42.head()

     Unnamed: 0   LICENSED INSTRUCTIONAL CLASSROOM Unnamed: 4      Unnamed: 5
0           NaN  EDUCATORS     PERSONNEL   TEACHER  PRINCIPAL  SUPERINTENDENT
1  HENDERSON CO     50,540        50,304    48,063     68,981         105,000
2     LEXINGTON     48,448        47,827    45,511     71,913          99,500
3      HENRY CO     50,404        50,121    47,613     76,753         125,400
4        *PARIS     53,391        52,826    50,863     85,571         108,303

In [34]:
df42.shape

(62, 6)

In [22]:
df43 = tabula.read_pdf("C:/Users/unews/nss_data_science/Capstone/ASR1617.pdf",pages=43)

In [23]:
df43.head()

    Unnamed: 0   LICENSED INSTRUCTIONAL CLASSROOM Unnamed: 4      Unnamed: 5
0          NaN  EDUCATORS     PERSONNEL   TEACHER  PRINCIPAL  SUPERINTENDENT
1  SULLIVAN CO     48,357        48,098    46,787     73,351         132,600
2      BRISTOL     56,033        55,582    52,591     96,979         146,019
3    KINGSPORT     59,696        59,254    57,120     94,810         181,605
4    SUMNER CO     49,170        49,086    46,988     85,660         191,646

In [35]:
df43.shape

(22, 6)

In [29]:
type(df41)

pandas.core.frame.DataFrame

In [31]:
asr1617=pd.concat([df41,df42])

In [36]:
asr1617.shape

(124, 6)

In [37]:
asr1617=pd.concat([asr1617,df43])

In [38]:
asr1617.shape

(146, 6)

In [39]:
asr1617.to_csv("C:/Users/unews/nss_data_science/Capstone/asr1617.csv")